app/controllers/projects_controller.rb

      def create

        @project = Project.new(project_params)
        @project.user = current_user
        @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Testing"], ["description", "Justing testing"], ["user_id", "11"], ["created_at", "2023-06-02 11:23:51.507460"], ["updated_at", "2023-06-02 11:23:51.507460"]]

      def update
        @project = Project.find(params[:id])
        if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Basecamp"], ["description", "My basecamp project "], ["updated_at", "2023-06-02 13:55:36.847049"], ["id", 10]]

      def created
        @projects = Project.all
---
SELECT "projects".* FROM "projects"