app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      @user = User.find(params[:id])
      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "email" = ?, "role" = ? WHERE "users"."id" = ?  [["name", "Martins"], ["updated_at", "2023-06-03 13:06:22.520445"], ["email", "martins@admin.com"], ["role", 1], ["id", 1]]

    def add_user
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "password", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)